hazem31/Embedded-Assignments/UNIT 7/LAB 5 STM32 EXTI/Drivers/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2022 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************
 */

#if !defined(__SOFT_FP__) && defined(__ARM_FP)
  #warning "FPU is not initialized, but the project is compiling for an FPU. Please initialize the FPU before use."
#endif

#include "stm32f103x6.h"
#include "Stm32_F103C6_gpio_driver.h"
#include "keypad.h"
#include "lcd.h"
#include "EXTI.h"

void clock_init()
{
	//Bit 2 IOPAEN: I/O port A clock enable
		RCC_GPIOA_CLK_EN();
	//Bit 3 IOPBEN: I/O port B clock enable
		RCC_GPIOB_CLK_EN();
		RCC_AFIO_CLK_EN();
}

//void GPIO_init()
//{
//	GPIO_PinConfig_t PinCfg;
//
//
//	//PA1 IN HighZ Floating input (reset state)
//	PinCfg.GPIO_PinNumber = GPIO_PIN_1;
//	PinCfg.GPIO_MODE = GPIO_MODE_INPUT_FLO;
//	MCAL_GPIO_Init(GPIOA, &PinCfg);
//
//	//PB1 output push/pull mode
//	PinCfg.GPIO_PinNumber = GPIO_PIN_1;
//	PinCfg.GPIO_MODE = GPIO_MODE_OUTPUT_PP;
//	PinCfg.GPIO_Output_Speed = GPIO_SPEED_10M;
//	MCAL_GPIO_Init(GPIOB, &PinCfg);
//	//==========================================
//
//	//PA13 IN HighZ
//	PinCfg.GPIO_PinNumber = GPIO_PIN_13;
//	PinCfg.GPIO_MODE = GPIO_MODE_INPUT_FLO;
//	MCAL_GPIO_Init(GPIOA, &PinCfg);
//
//	//PB13 output push/pull mode
//	PinCfg.GPIO_PinNumber = GPIO_PIN_13;
//	PinCfg.GPIO_MODE = GPIO_MODE_OUTPUT_PP;
//	PinCfg.GPIO_Output_Speed = GPIO_SPEED_10M;
//	MCAL_GPIO_Init(GPIOB, &PinCfg);
//}

unsigned int IRQ_FLAG = 0;

void wait(int x)
{
	unsigned int i ,j;
	for(i=0;i<x;i++)
		for(j=0;j<255;j++);
}


void EXTI9PB9_CallBack(void)
{
	IRQ_FLAG = 1;
	LCD_WRITE_STRING("IRQ EXTI9 is happening -|]");
	wait(1000);
}

int main(void)
{
	clock_init();
	//GPIO_init();
	LCD_INIT();
	LCD_clear_screen();
	LCD_WRITE_CHAR('A');
	wait(1000);
	EXTI_PinConfig_t EX;
	EX.EXTI_PIN = EXTI9PB9;
	EX.IRQ_EN = EXTI_IRQ_Enable;
	EX.Trigger_Case = EXTI_Trigger_RISING;
	EX.P_IRQ_callBack = EXTI9PB9_CallBack;

	MCAL_EXTI_GPIO_Init(&EX);

	IRQ_FLAG = 1;
	while(1)
	{
		if(IRQ_FLAG == 1)
		{
			LCD_clear_screen();
			LCD_WRITE_CHAR('C');
			IRQ_FLAG = 0;
		}
	}
}



//		//PA1 >>>Connected external  PUR (default 1)
//		if( MCAL_GPIO_ReadPin(GPIOA, GPIO_PIN_1) == 0) //Press
//		{
//			MCAL_GPIO_TogglePin(GPIOB, GPIO_PIN_1);
//			while( MCAL_GPIO_ReadPin(GPIOA, GPIO_PIN_1) == 0); //Single Press
//		}
//
//		//PA13 >>>Connected external  PDR (default 0)
//		if( MCAL_GPIO_ReadPin(GPIOA, GPIO_PIN_13) == 1) //Multi Press
//		{
//			MCAL_GPIO_TogglePin(GPIOB, GPIO_PIN_13);
//		}
//		wait(4);
